<a href="https://colab.research.google.com/github/keliwu5/ML100Days/blob/main/homework/%E4%BD%9C%E6%A5%AD%E9%A1%8C%E7%9B%AE_D11.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

作業目標:<br>
1. 運用編碼處理類別資料<br>
2. 補缺失值

作業重點: <br>
1. 類別編碼有多種方法，需分辨使用方法與時機<br>
2. 補缺失值須因應情境決定如何補值

題目 : 
將以下問卷資料的職業(Profession)欄位缺失值填入字串'others'，更進一步將字串做編碼。
此時用什麼方式做編碼比較適合?為什麼?

import pandas as pd <br>
q_df = pd.DataFrame([['male', 'teacher'], 
              ['male', 'engineer'],
              ['female', None],
              ['female', 'engineer']],columns=['Sex','Profession'])

In [4]:
import pandas as pd
q_df = pd.DataFrame([['male', 'teacher'], 
              ['male', 'engineer'],
              ['female', None],
              ['female', 'engineer']],columns=['Sex','Profession'])
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female       None
3  female   engineer

In [14]:
#缺失值填入字串'others'
q_df = q_df.fillna('others')

In [15]:
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female     others
3  female   engineer

In [12]:
#更進一步將字串做編碼。 此時用什麼方式做編碼比較適合?為什麼?
#from sklearn.preprocessing import LabelEncoder
#filna_df['Profession_label'] = LabelEncoder().fit_transform(filna_df['Profession'].values)

In [21]:
q_df[['Profession']]

  Profession
0    teacher
1   engineer
2     others
3   engineer

In [23]:
type(q_df[['Profession']])

pandas.core.frame.DataFrame

In [32]:
#更進一步將字串做編碼。 此時用什麼方式做編碼比較適合?為什麼?
pf = pd.get_dummies(q_df[['Profession']])

In [33]:
type(q_df)

pandas.core.frame.DataFrame

In [34]:
type(pf)

pandas.core.frame.DataFrame

In [35]:
con_df = pd.concat([q_df, pf], axis=1)

In [36]:
con_df

      Sex Profession  ...  Profession_others  Profession_teacher
0    male    teacher  ...                  0                   1
1    male   engineer  ...                  0                   0
2  female     others  ...                  1                   0
3  female   engineer  ...                  0                   0

[4 rows x 5 columns]